Revit 2024 API
BuiltInFailures.RebarShapeFailures.DefaultParamaterValuesIncorrect Property
 Default parameters have incorrect values. One reason for failure might be an edge length that is too short (it's smaller than bent radius).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DefaultParamaterValuesIncorrect { get; }
Visual Basic
Public Shared ReadOnly Property DefaultParamaterValuesIncorrect As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DefaultParamaterValuesIncorrect {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace